{
    "markdown": "edigitalsurvey.com\n\n# edigitalsurvey.com is blocked\n\nThis page has been blocked by an extension\n\n- Try disabling your extensions.\n\nERR\\_BLOCKED\\_BY\\_CLIENT\n\nReload\n\n\nThis page has been blocked by an extension\n\n![](<Base64-Image-Removed>)![](<Base64-Image-Removed>)\n\n[Skip to content](https://www.bbc.com/news/articles/cy08n8x6788o#main-content)\n\nAdvertisement\n\n[Home](https://www.bbc.com/)\n\nNews\n\n[Sport](https://www.bbc.com/sport)\n\nBusiness\n\nInnovation\n\nCulture\n\nArts\n\nTravel\n\nEarth\n\nAudio\n\n[Video](https://www.bbc.com/video)\n\nLive\n\n[Weather](https://www.bbc.com/weather)\n\n[Newsletters](https://www.bbc.com/newsletters)\n\n[Watch Live](https://www.bbc.com/watch-live-news/)\n\nAdvertisement\n\n# Gaza air drops 'a grotesque distraction', aid agencies warn\n\n26 July 2025\n\nShare\n\nSave\n\nJoe Inwood\n\nWorld news correspondent\n\nShare\n\nSave\n\n![Reuters An Israeli soldier stands next to the parcels of humanitarian aid ](https://ichef.bbci.co.uk/news/480/cpsprodpb/57ea/live/e78c12c0-6a75-11f0-8dbd-f3d32ebd3327.jpg.webp)Reuters\n\nThe focus on air drops into Gaza is a \"grotesque distraction\" that will not reverse the territory's deepening starvation crisis, aid agency leaders have warned.\n\nIsrael's military said early on Sunday that it had airdropped humanitarian aid into the Gaza Strip, after also announcing humanitarian corridors for UN aid convoys.\n\nThe United Arab Emirates (UAE) and Jordan are expected to conduct air drops in the coming days, and UK Prime Minister Keir Starmer has said the British government is committing \"everything we can\" to get aid to Gaza via air drops.\n\nCiarán Donnelly, of the International Rescue Committee, said aid drops could \"never deliver the volume or the quality\" of aid needed, however.\n\nMore than 100 international aid organisations and human rights groups have warned of mass starvation in the Strip.\n\n- [Almost a third of people in Gaza not eating for days, UN food programme warns](https://www.bbc.co.uk/news/articles/ckgjg81qqwvo)\n\nThe Hamas-run Gaza health ministry reported an additional five deaths due to malnutrition on Saturday, bringing the total to 127 since the war began. That number includes 85 children.\n\nThe World Food Programme has warned that one in three Gazans are not eating for days at a time and that 90,000 women and children are in urgent need of treatment in what it described as a \"man-made mass starvation\".\n\nThe debate over air drops has come about primarily due to the failure of aid to enter Gaza via the traditional land routes.\n\nThe head of the UN's Palestinian refugee agency Unrwa, Philippe Lazzarini, said earlier on Saturday that air drops are \"expensive, inefficient, and can even kill starving civilians\" if they go awry.\n\nLazzarini said his organisation had \"the equivalent of 6,000 trucks\" in Jordan and Egypt, waiting for the \"green light\" to enter Gaza.\n\nHe said political will is required to \"lift the siege, open the gates and guarantee safe movements and dignified access to people in need\".\n\n\"Driving aid through is much easier, more effective, faster, cheaper & safer. It's more dignified for the people of Gaza,\" Lazzarini wrote.\n\nHis comments came prior to Israel's announcement that it would establish what it called \"designated humanitarian corridors to enable the safe movement of UN convoys delivering food and medicine.\" It did not outline where those would be or how they would operate.\n\nIsrael maintains there are no restrictions on aid getting into Gaza, with a government spokesperson previously suggesting the UN is working with Hamas to disrupt aid distribution.\n\nThe UN rejects that, and says Israel is obstructing its ability to collect aid inside Gaza through bureaucratic obstacles.\n\nHamas denies it has been stealing aid from collection points. A recent USAID report said there was no evidence of systematic looting.\n\nThis isn't the first time Western and Arab governments have tried to get aid into Gaza from the air.\n\nLast year, Britain's Royal Air Force delivered 110 tonnes of aid over the course of 10 drops as part of a Jordanian-led international air coalition.\n\nHowever, those quantities would do little to alleviate the risks of mass starvation being seen in Gaza, aid agencies have said.\n\nAnalysis by the BBC has found that around 160 planes would be needed to provide enough food for a single meal for each of Gaza's two million residents.\n\nUS Central Command (Centcom) figures from last year how their C-130 cargo planes delivered approximately 12,650 meals per plane, per trip.\n\nThat would mean more than 160 flights would be needed to deliver a single meal for every one of Gaza's roughly 2.1 million population.\n\nJordan is thought to have around 10 C-130s and the UAE a further eight.\n\n![](https://static.files.bbci.co.uk/bbcdotcom/web/20250814-092707-b0ec5bc3fc-web-2.27.1-1/grey-placeholder.png)![Reuters A little boy cries as he waits for food at a charity kitchen, his arms pushed through a railing, clutching a pot, towards the camera. ](https://ichef.bbci.co.uk/news/480/cpsprodpb/6455/live/580ad270-6a44-11f0-af20-030418be2ca5.jpg.webp)Reuters\n\nThe Hamas-run Gaza health ministry says 85 children have died of malnutrition since the war began\n\nSeveral aid groups have warned about the dangers of dropping thousands of tonnes of food onto densely populated Gaza.\n\nShaina Low of the Norwegian Refugee Council said people were \"drowning\" as they tried to collect aid that had blown into the Mediterranean, and that boxes had \"crushed people\" as they fell from the sky.\n\nEven when drops were successful \"it was chaos\", she said. \"People were fighting over the aid. People were getting injured.\"\n\nAnd fears are rife within Gaza about the risks. The BBC spoke to several Gazans on Saturday who worried the drops could cause \"serious harm\".\n\nOne man living in the north of the Strip told BBC Arabic's Middle East Daily the process is \"unsafe\" and has \"caused numerous tragedies\".\n\n\"When aid is dropped from the air, it risks landing directly on tents, potentially causing serious harm, including injury or even death,\" he said.\n\nMeanwhile, Palestinians are battling dehydration along with starvation. One mother told the BBC she was \"living with no food or drink, no food, no bread, not even water.\n\n\"We're craving even water,\" she said.\n\nIsrael launched a war in Gaza in response to the Hamas-led attack on southern Israel on 7 October 2023, in which about 1,200 people were killed and 251 others were taken hostage.\n\nMore than 59,000 people have been killed in Gaza since then, according to the Hamas-run health ministry.\n\nIsrael imposed a total blockade of aid deliveries at the start of March and resumed its military offensive against Hamas two weeks later, collapsing a two-month ceasefire. It said it wanted to put pressure on the group to release its remaining Israeli hostages.\n\nAlthough the blockade was partially eased after almost two months amid warnings of a looming famine from global experts, the shortages of food, medicine and fuel have worsened.\n\nMost of Gaza's population has been displaced multiple times and more than 90% of homes are estimated to be damaged or destroyed.\n\n[**French pledge to recognise Palestine is a gamble - so will Starmer follow suit?**](https://www.bbc.co.uk/news/articles/cy8g8wnwdvwo)\n\n[Israel-Gaza war](https://www.bbc.com/news/topics/c2vdnvdg6xxt)\n\n[Israel](https://www.bbc.com/news/topics/c302m85q5ljt)\n\n* * *",
    "metadata": {
      "favicon": "https://static.files.bbci.co.uk/bbcdotcom/web/20250814-092707-b0ec5bc3fc-web-2.27.1-1/favicon-32x32.png",
      "page.section": "News",
      "viewport": [
        "width=device-width",
        "width=device-width, initial-scale=1.0,\n                                 maximum-scale=1.0, user-scalable=no"
      ],
      "og:image:alt": "An Israeli soldier stands next to the parcels of humanitarian aid",
      "theme-color": [
        "#ffffff",
        "#fff"
      ],
      "title": "Gaza air drops 'a grotesque distraction', aid agencies warn",
      "al:android:package": "bbc.mobile.news.ww",
      "page.subsection": "Middle_east",
      "ogTitle": "Gaza air drops 'a grotesque distraction', aid agencies warn",
      "next-head-count": "42",
      "al:ios:app_store_id": "364147881",
      "og:image": "https://ichef.bbci.co.uk/news/1024/branded_news/57ea/live/e78c12c0-6a75-11f0-8dbd-f3d32ebd3327.jpg",
      "og:description": "Several aid groups say dropping food from the air onto densely populated Gaza is a risk to civilian lives.",
      "ogDescription": "Several aid groups say dropping food from the air onto densely populated Gaza is a risk to civilian lives.",
      "robots": "NOODP, NOYDIR",
      "ogImage": "https://ichef.bbci.co.uk/news/1024/branded_news/57ea/live/e78c12c0-6a75-11f0-8dbd-f3d32ebd3327.jpg",
      "twitter:image:src": "https://ichef.bbci.co.uk/news/1024/branded_news/57ea/live/e78c12c0-6a75-11f0-8dbd-f3d32ebd3327.jpg",
      "al:android:app_name": "BBC: World News & Stories",
      "description": "Several aid groups say dropping food from the air onto densely populated Gaza is a risk to civilian lives.",
      "al:ios:app_name": "BBC: World News & Stories",
      "language": "en-GB",
      "msapplication-TileColor": "#da532c",
      "al:web:url": "https://bbc.com/news/articles/cy08n8x6788o",
      "article:modified_time": "2025-07-27T00:28:43.854Z",
      "cXenseParse:publishtime": "2025-07-26T23:03:48.733Z",
      "cXenseParse:author": "Joe Inwood",
      "twitter:card": "summary_large_image",
      "google-site-verification": "auTeTTwSt_KBY_4iDoR00Lwb7-qzx1IgzJy6ztaWgEI",
      "color-scheme": "light dark",
      "twitter:description": "Several aid groups say dropping food from the air onto densely populated Gaza is a risk to civilian lives.",
      "version": "web-2.27.1-1",
      "og:title": "Gaza air drops 'a grotesque distraction', aid agencies warn",
      "al:ios:url": "bbcx://news/articles/cy08n8x6788o",
      "twitter:image:alt": "An Israeli soldier stands next to the parcels of humanitarian aid",
      "cXenseParse:pageclass": "article",
      "al:android:url": "bbcx://news/articles/cy08n8x6788o",
      "apple-itunes-app": "app-id=364147881, app-argument=https://www.bbc.com/news/articles/cy08n8x6788o",
      "twitter:title": "Gaza air drops 'a grotesque distraction', aid agencies warn",
      "scrapeId": "0d2f7301-5eab-4015-afbe-54df40dd435e",
      "sourceURL": "www.bbc.com/news/articles/cy08n8x6788o",
      "url": "https://www.bbc.com/news/articles/cy08n8x6788o",
      "statusCode": 200,
      "contentType": "text/html; charset=utf-8",
      "proxyUsed": "basic",
      "cacheState": "hit",
      "cachedAt": "2025-08-25T13:55:42.731Z",
      "creditsUsed": 1
    }
  }